# Pandas

Pandas is built on top of the Numpy. Which provides efficient implementation of ``DataFrame`` and ``Series``.
``DataFrame`` is multi-dimensinal array with row and column, just like a table. It contains heterogenous data and missing data as well.


Numpy has its own limitation when working much larger dataset and we want more flexibility for example working with missing data. Pandas operations are much more useful when data is not well structured

In [57]:
import pandas as pd
import numpy as np

## Series Object

It is one dimensional array of indexed data It can be created from ``list``

In [5]:
series = pd.Series([1,2,3,4,0.5])
series

0    1.0
1    2.0
2    3.0
3    4.0
4    0.5
dtype: float64

Notice in above output of ``series`` object that it provides both ``index`` as well as ``values`` which can be accessed as shown below

In [6]:
series.values

array([1. , 2. , 3. , 4. , 0.5])

In [7]:
series.index

RangeIndex(start=0, stop=5, step=1)

Accessing series data using index

In [8]:
series[3]

4.0

In ``series``, index doesn't need to be always integers, we can have ``string`` index as well.
What it means that, it is possible to expliciltly define index for ``series`` in

In [401]:
series = pd.Series([3,2,6,5,5.7], index=['a','b','c','d','e'])
series

a    3.0
b    2.0
c    6.0
d    5.0
e    5.7
dtype: float64

In [402]:
series['e']

5.7

In [16]:
series.b

2.0

In [17]:
# non-contiguous index
series = pd.Series([3,2,6,5,5.7], index=[1,3,4,7,0])
series

1    3.0
3    2.0
4    6.0
7    5.0
0    5.7
dtype: float64

We can construct ``Series`` object from Python ``dictionary``

In [403]:
employees_d = {
    "john" : 101,
    "andrew" : 201,
    "alice" : 301,
    "bob" : 401
}

employees = pd.Series(employees_d)
employees

john      101
andrew    201
alice     301
bob       401
dtype: int64

In [22]:
employees.values

array([101, 201, 301, 401])

In [23]:
employees.index

Index(['john', 'andrew', 'alice', 'bob'], dtype='object')

In [404]:
employees["john"]

101

Accessing ``Series`` in list-style operation

In [380]:
employees["john":"alice"]

john      101
andrew    201
alice     301
dtype: int64

Creating ``Series`` from dictionary and explicitly assign ``index``

In [407]:
series = pd.Series({2:'a', 1:'b', 3:'c'}, index=[4,1,2])
series

4    NaN
1      b
2      a
dtype: object

Creating ``Series`` from scalar value

In [410]:
series = pd.Series(10,index=[1,2,3,4])
#series = pd.Series(20)
series

1    10
2    10
3    10
4    10
dtype: int64

## Dataframe Object

If you consider ``Series`` as one-dimensional array with flexible indices, you can think of ``DataFrame``
as two-dimensional array with flexible row and column indices.
Another way of thinking ``DataFrame`` is as sequence of aligned ``Series`` i.e each column in ``DataFrame`` can considered as ``Series``

In [413]:
employees_salary = {
    "john" : 60000,
    "andrew" : 70000,
    "alice" : 65000,
    "bob" : 75000
}

salary = pd.Series(employees_salary)
print(salary)
print('----------')
print(employees)

john      60000
andrew    70000
alice     65000
bob       75000
dtype: int64
----------
john      101
andrew    201
alice     301
bob       401
dtype: int64

Now we can construct two-dimensional ``Datafram`` from this two ``Series``

In [414]:
employee_info = pd.DataFrame({'ID':employees,'Salary':salary})
employee_info

         ID  Salary
john    101   60000
andrew  201   70000
alice   301   65000
bob     401   75000

We can access indices of ``DataFrame`` using ``index`` attribute

In [44]:
employee_info.index

Index(['john', 'andrew', 'alice', 'bob'], dtype='object')

``DataFrame`` also contains ``columns`` attribute, which gives labels of ``columns``

In [46]:
employee_info.columns

Index(['ID', 'Salary'], dtype='object')

We can think of ``DataFrame`` as Python dictionary as well. As in dictionary, key is mapped to values, in ``DataFrame`` column name is mapped to ``Series`` of column data

In [415]:
employee_info['Salary']

john      60000
andrew    70000
alice     65000
bob       75000
Name: Salary, dtype: int64

### DataFrame object creation

``DataFrame`` is collection of ``Series`` objects. ``DataFrame`` created from single ``Series`` is single column ``DataFrame``

In [416]:
pd.DataFrame({'Salary':salary})

        Salary
john     60000
andrew   70000
alice    65000
bob      75000

In [51]:
pd.DataFrame(salary, columns=['Salary'])

        Salary
john     60000
andrew   70000
alice    65000
bob      75000

``DataFrame`` from list of dictionaries

In [418]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

   a  b
0  0  0
1  1  2
2  2  4

``DataFrame`` from missing keys

In [55]:
data = [{'a': 1, 'b': 2}, {'b':4, 'c':6}]
pd.DataFrame(data)

     a  b    c
0  1.0  2  NaN
1  NaN  4  6.0

``DataFrame`` from two-dimensional Numpy array

In [424]:
data = np.random.rand(3,2)
data

array([[0.17072988, 0.0807449 ],
       [0.98220856, 0.83114816],
       [0.12554636, 0.48221083]])

In [425]:
pd.DataFrame(data,columns=['c1','c2'],index=[0,1,2])
#pd.DataFrame(data,index=[0,1,2])

         c1        c2
0  0.170730  0.080745
1  0.982209  0.831148
2  0.125546  0.482211

## Indexing and Selection

Indexing and Selection in ``Series``

In [426]:
series = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
series

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [62]:
series['b']

0.5

Check whether index is present in ``Series`` or not. It same like checking element in ``list`` or checking keys in ``dictionary``

In [430]:
'c' in series

True

In [66]:
series.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [68]:
# converting series to list
list(series.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

It is possible to modify ``Series`` object

In [432]:
series['e'] = 4.5
series

a    0.25
b    0.50
c    0.75
d    4.50
e    4.50
dtype: float64

Slicing and Masking in ``Series``

In [70]:
#using explicit index
series['b':'d']

b    0.50
c    0.75
d    4.50
dtype: float64

In [71]:
#using implicit index
series[0:2]

a    0.25
b    0.50
dtype: float64

In [435]:
#masking
#series > 1
print(series)
print(series > 1)
series[(series > 1)]
#print(type(series))

a    0.25
b    0.50
c    0.75
d    4.50
e    4.50
dtype: float64
a    False
b    False
c    False
d     True
e     True
dtype: bool

d    4.5
e    4.5
dtype: float64

## Indexers : loc,iloc

In ``Series`` if explicit indexes are integer, it can lead to confusion while slicing and index. See example below

In [437]:
data = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
data

1    a
2    b
3    c
dtype: object

In [438]:
# it uses explicit index
data[1]

'a'

In [439]:
# it uses implicit index
data[1:3]

2    b
3    c
dtype: object

``Indexers`` are used to eliminate this confusion. ``loc`` attribute always points to explicit index

In [93]:
data.loc[1]

'a'

In [440]:
data.loc[1:2]

1    a
2    b
dtype: object

``iloc`` always points to implicit index

In [90]:
data.iloc[0]

'a'

In [91]:
data.iloc[0:2]

1    a
2    b
dtype: object

It is always a good practice to use ``iloc`` and ``loc``. It makes code readable and remove any potential confusion regarding index. Use this ``indexers`` as much as possible

## Data selection in DataFrame

As mentioned earlier ``DataFrame`` can be think of as a two-dimensional array of dictionary of ``Series``. Keeping this in mind, let's explore data selection in ``DataFrame``

In [441]:
salary

john      60000
andrew    70000
alice     65000
bob       75000
dtype: int64

In [97]:
employees

john      101
andrew    201
alice     301
bob       401
dtype: int64

In [442]:
dataframe = pd.DataFrame({'ID':employees, 'Salary':salary})
dataframe

         ID  Salary
john    101   60000
andrew  201   70000
alice   301   65000
bob     401   75000

Accessing individual ``Series`` which makes up column

In [100]:
dataframe['ID']

john      101
andrew    201
alice     301
bob       401
Name: ID, dtype: int64

In [101]:
dataframe.ID

john      101
andrew    201
alice     301
bob       401
Name: ID, dtype: int64

Above explained attribute-style access doesn't work sometimes. For example ``DataFrame`` has ``pop()`` method and ``DataFrame`` contain ``pop`` column. In this ``dataframe.pop`` points to ``pop()`` method rather than ``pop`` column

Adding new column

In [443]:
dataframe['department'] = ['A','B','C','D']
dataframe

         ID  Salary department
john    101   60000          A
andrew  201   70000          B
alice   301   65000          C
bob     401   75000          D

In [444]:
dataframe.values

array([[101, 60000, 'A'],
       [201, 70000, 'B'],
       [301, 65000, 'C'],
       [401, 75000, 'D']], dtype=object)

In [112]:
# Transposing DF
dataframe.T

             john andrew  alice    bob
ID            101    201    301    401
Salary      60000  70000  65000  75000
department      A      B      C      D

In [114]:
dataframe.values[0]

array([101, 60000, 'A'], dtype=object)

In [115]:
dataframe['Salary']

john      60000
andrew    70000
alice     65000
bob       75000
Name: Salary, dtype: int64

``loc``, ``iloc``  in ``DataFrame``

In [446]:
dataframe

         ID  Salary department
john    101   60000          A
andrew  201   70000          B
alice   301   65000          C
bob     401   75000          D

In [447]:
dataframe.iloc[:3,:2]

         ID  Salary
john    101   60000
andrew  201   70000
alice   301   65000

In [126]:
dataframe.loc[:'alice',:'Salary']

         ID  Salary
john    101   60000
andrew  201   70000
alice   301   65000

Combining masking operation with ``loc``

In [448]:
print(dataframe)
dataframe.loc[dataframe.Salary > 65000]

         ID  Salary department
john    101   60000          A
andrew  201   70000          B
alice   301   65000          C
bob     401   75000          D

         ID  Salary department
andrew  201   70000          B
bob     401   75000          D

Modifying values in ``DataFrame``

In [132]:
dataframe.iloc[1,2] = 'E'
dataframe

         ID  Salary department
john    101   60000          A
andrew  201   70000          E
alice   301   65000          C
bob     401   75000          D

#### Keep in mind that, indexing refers to columns, while slicing refers to row

In [449]:
dataframe['Salary']

john      60000
andrew    70000
alice     65000
bob       75000
Name: Salary, dtype: int64

In [136]:
dataframe['john' : 'alice']

         ID  Salary department
john    101   60000          A
andrew  201   70000          E
alice   301   65000          C

## Operations on Data

In [450]:
series = pd.Series(np.random.randint(0,10,5))
series

0    1
1    6
2    7
3    3
4    1
dtype: int64

All operation which can be done on ``Series`` and ``DataFrames``, preserves the indices of object

In [451]:
np.power(series,2)

0     1
1    36
2    49
3     9
4     1
dtype: int64

In [453]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  8  9  7  2
1  1  1  6  6
2  7  2  8  1

In [454]:
np.power(df,2)

    A   B   C   D
0  64  81  49   4
1   1   1  36  36
2  49   4  64   1

As shown in above example ``Pandas`` performs element-wise operation, which is inherited from ``Numpy``

In [457]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
print('------------')
print(population)

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64
------------
California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [458]:
density = area/population
density

Alaska             NaN
California    0.011060
New York           NaN
Texas         0.026303
dtype: float64

In above case, resulting ``Series`` contains indexes obtained from union operation. Pandas automatically assings NaN(Not a number) whenever there is a mismatch. This is how ``pandas`` handles missing values

Let's look at similar kind of operation on ``DataFrame``

In [459]:
df1 = pd.DataFrame(np.random.randint(0, 10, (2, 2)),
                  columns=['A', 'B'])
df1

   A  B
0  6  6
1  1  8

In [460]:
df2 = pd.DataFrame(np.random.randint(0, 10, (3, 3)),
                  columns=['A', 'B', 'C'])
df2

   A  B  C
0  4  0  8
1  5  2  3
2  5  9  4

In [462]:
df1 * df2

      A     B   C
0  24.0   0.0 NaN
1   5.0  16.0 NaN
2   NaN   NaN NaN

## Operation between DataFrame and Series

Operation between ``DataFrame`` and ``Series`` can be thought of operation between two-dimensioan array and one-dimensional array.

In [463]:
df2

   A  B  C
0  4  0  8
1  5  2  3
2  5  9  4

In [467]:
ser = pd.Series([4,6,5,8],index=['A',"B",'C','D'])
ser

A    4
B    6
C    5
D    8
dtype: int64

In [466]:
df2 - ser

   A  B  C
0  0 -6  3
1  1 -4 -2
2  1  3 -1

## Handling missing Data

In Pandas, missing data is represented as ``NaN`` or ``None``. Pandas provide several useful methods for detecting, removing and replacing missing values

* ``isnull()`` : Checks for missing values <br>
* ``notnull()`` : Checks for not null values <br>
* ``dropna()`` : Filters null values <br>
* ``fillna()`` : Return copy of data with missing values filled <br>

#### Detecting null values

In [471]:
ser = pd.Series([2,np.nan,'hey',None])
ser
ser.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [472]:
ser[ser.isnull()]

1     NaN
3    None
dtype: object

In [473]:
ser.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [475]:
ser.notnull().sum()
ser[ser.notnull()]

2

#### Dropping null values

In [476]:
ser.dropna()

0      2
2    hey
dtype: object

In the case of ``DataFrame``, all the columns and rows which has ``null`` will be dropped. See below example

In [477]:
df = pd.DataFrame([[1,np.nan, 2],
                   [2, 3, 5],
                   [np.nan,4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [478]:
df.dropna()

     0    1  2
1  2.0  3.0  5

It is not possible to drop single values from ``DataFrame``. We can drop full row or full column. By default ``dropna()`` drops all rows which has ``null`` value

In [480]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

This approach sometimes drops some useful data. We should drop those columns or rows which has majority of ``null`` values. So for ``DataFrame`` we can use ``how`` and ``thresh`` parameters, to determine how many ``null`` values we want to remove

In [481]:
df[3] = None
df

     0    1  2     3
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [395]:
df.dropna(axis=1, how='all') #how = "any"

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

``thresh`` allow us to define minimum value of non-null values we want

In [482]:
df

     0    1  2     3
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [397]:
df.dropna(thresh=3)    ---> drop all rows where non null values is >= 3

     0    1  2     3
1  2.0  3.0  5  None

#### Filling null values

Sometimes it is better to fill the null value with appropriate value rather than dropping it. ``fillna()`` function provides copy of array with null values replaces

In [483]:
ser = pd.Series([None,10, None, 2, None, 3], index=['a','b','c','d','e','f'])
ser

a     NaN
b    10.0
c     NaN
d     2.0
e     NaN
f     3.0
dtype: float64

fill null values with 0

In [484]:
ser.fillna(4)

a     4.0
b    10.0
c     4.0
d     2.0
e     4.0
f     3.0
dtype: float64

We can ``ffill`` and ``bfill`` method to propagate previous and next value respectively

In [201]:
ser.fillna(method='ffill') #forward-fill

a     NaN
b    10.0
c    10.0
d     2.0
e     2.0
f     3.0
dtype: float64

In [203]:
ser.fillna(method='bfill') #backward-fill

a    10.0
b    10.0
c     2.0
d     2.0
e     3.0
f     3.0
dtype: float64

``fillna()`` for ``DataFrame``

In [485]:
df

     0    1  2     3
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [399]:
df.fillna(method='ffill')

     0    1  2     3
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  2.0  4.0  6  None

In [210]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

### Join  and Merge operation
The ``pd.merge()`` can perform three types of join operation, those are the one-to-one, many-to-one, and many-to-many. Let's see simple example to understand how this works

In [488]:
df1 = pd.DataFrame({'employee': ['Bob', 'Andrew', 'Alice', 'John'],
                    'dept.': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Andrew', 'Bob', 'Alice', 'John'],
                    'hire_year': [2004, 2008, 2012, 2014]})
df1

  employee        dept.
0      Bob   Accounting
1   Andrew  Engineering
2    Alice  Engineering
3     John           HR

In [229]:
df2

  employee  hire_year
0   Andrew       2004
1      Bob       2008
2    Alice       2012
3     John       2014

#### One-to-One join

Let's combine this into single ``DataFrame``

In [230]:
df3 = pd.merge(df1,df2)
df3

  employee        dept.  hire_year
0      Bob   Accounting       2008
1   Andrew  Engineering       2004
2    Alice  Engineering       2012
3     John           HR       2014

#### Many-to-One join

When one of the two key columns contains duplicate values, ``Many-to-One`` joined is performed

In [486]:
df4 = pd.DataFrame({'dept.': ['Accounting', 'Engineering', 'HR'],
                    'manager': ['Carl', 'Michael', 'Steve']})
display(df3,df4)

  employee        dept.  hire_year
0      Bob   Accounting       2008
1   Andrew  Engineering       2004
2    Alice  Engineering       2012
3     John           HR       2014

         dept.  manager
0   Accounting     Carl
1  Engineering  Michael
2           HR    Steve

In [236]:
pd.merge(df3,df4)

  employee        dept.  hire_year  manager
0      Bob   Accounting       2008     Carl
1   Andrew  Engineering       2004  Michael
2    Alice  Engineering       2012  Michael
3     John           HR       2014    Steve

#### ``left_on`` and ``right_on``

Sometimes you may wish to merge two datasets with different column names; for example, we may have a dataset in which the employee name is labeled as "name" rather than "employee". In this case, we can use the ``left_on`` and ``right_on`` keywords to specify the two column names:

In [489]:
df1

  employee        dept.
0      Bob   Accounting
1   Andrew  Engineering
2    Alice  Engineering
3     John           HR

In [490]:
df2 = pd.DataFrame({'name': ['Bob', 'Andrew', 'Alice', 'John'],
                    'salary': [70000, 80000, 120000, 90000]})
df2

     name  salary
0     Bob   70000
1  Andrew   80000
2   Alice  120000
3    John   90000

In [241]:
pd.merge(df1, df2, left_on="employee", right_on="name")

  employee        dept.    name  salary
0      Bob   Accounting     Bob   70000
1   Andrew  Engineering  Andrew   80000
2    Alice  Engineering   Alice  120000
3     John           HR    John   90000

The result has repeated column, which can be dropped using ``drop()``

In [492]:
pd.merge(df1, df2, left_on="employee", right_on="name").drop('name',axis=1)

  employee        dept.  salary
0      Bob   Accounting   70000
1   Andrew  Engineering   80000
2    Alice  Engineering  120000
3     John           HR   90000

Sometimes value is presented in one key column but not in another. This is how pandas handle that kind of data

In [493]:
df4 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df5 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
df4

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [494]:
df5

     name drink
0    Mary  wine
1  Joseph  beer

In [495]:
pd.merge(df4,df5)

   name   food drink
0  Mary  bread  wine

Here join is performed only where entry in key column matches. This is called ``inner`` join

We can use ``how`` keyword to specify type of join. Options for ``how`` are ``outer``, ``left``, ``right``

``outer`` joins return the join over union operation

In [496]:
pd.merge(df4,df5, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [498]:
print(df4)
print('--------')
print(df5)
pd.merge(df4,df5, how='left')

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
--------
     name drink
0    Mary  wine
1  Joseph  beer

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [249]:
pd.merge(df4,df5, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

#### ``on`` keyword

``on`` is used when we have conflicting column names. In this case we need specify on which column we want to perform the join operation

In [499]:
df8 = pd.DataFrame({'name': ['Bob', 'Alice', 'Andrew', 'Jonh'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Alice', 'Andrew', 'Jonh'],
                    'rank': [3, 1, 4, 2]})
print(df8)
print('---------')
print(df9)
pd.merge(df8,df9,on='name')

     name  rank
0     Bob     1
1   Alice     2
2  Andrew     3
3    Jonh     4
---------
     name  rank
0     Bob     3
1   Alice     1
2  Andrew     4
3    Jonh     2

     name  rank_x  rank_y
0     Bob       1       3
1   Alice       2       1
2  Andrew       3       4
3    Jonh       4       2

In [504]:
population = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

display(pop.head(), areas.head(), abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

Given above data our goal is to rank US states based on their 2010 population density. We can not get this information directly from the given data but we can derive this information from whatever information we have

First step is to merge the "population"  and "abbrevation" ``DataFrame`` into new ``DataFrame`` which will give us the information about full name of the state. We need to do ``outer`` join in order to preserve the duplication information

In [506]:
state_pop = pd.merge(population, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
state_pop = state_pop.drop('abbreviation', 1) # drop duplicate info
state_pop.head()
state_pop

     state/region     ages  year   population    state
0              AL  under18  2012    1117489.0  Alabama
1              AL    total  2012    4817528.0  Alabama
2              AL  under18  2010    1130966.0  Alabama
3              AL    total  2010    4785570.0  Alabama
4              AL  under18  2011    1125763.0  Alabama
5              AL    total  2011    4801627.0  Alabama
6              AL    total  2009    4757938.0  Alabama
7              AL  under18  2009    1134192.0  Alabama
8              AL  under18  2013    1111481.0  Alabama
9              AL    total  2013    4833722.0  Alabama
10             AL    total  2007    4672840.0  Alabama
11             AL  under18  2007    1132296.0  Alabama
12             AL    total  2008    4718206.0  Alabama
13             AL  under18  2008    1134927.0  Alabama
14             AL    total  2005    4569805.0  Alabama
15             AL  under18  2005    1117229.0  Alabama
16             AL    total  2006    4628981.0  Alabama
17             AL  under18  2006    1126798.0  Alabama
18             AL    total  2004    4530729.0  Alabama
19             AL  under18  2004    1113662.0  Alabama
20             AL    total  2003    4503491.0  Alabama
21             AL  under18  2003    1113083.0  Alabama
22             AL    total  2001    4467634.0  Alabama
23             AL  under18  2001    1120409.0  Alabama
24             AL    total  2002    4480089.0  Alabama
25             AL  under18  2002    1116590.0  Alabama
26             AL  under18  1999    1121287.0  Alabama
27             AL    total  1999    4430141.0  Alabama
28             AL    total  2000    4452173.0  Alabama
29             AL  under18  2000    1122273.0  Alabama
...           ...      ...   ...          ...      ...
2514          USA  under18  1999   71946051.0      NaN
2515          USA    total  2000  282162411.0      NaN
2516          USA  under18  2000   72376189.0      NaN
2517          USA    total  1999  279040181.0      NaN
2518          USA    total  2001  284968955.0      NaN
2519          USA  under18  2001   72671175.0      NaN
2520          USA    total  2002  287625193.0      NaN
2521          USA  under18  2002   72936457.0      NaN
2522          USA    total  2003  290107933.0      NaN
2523          USA  under18  2003   73100758.0      NaN
2524          USA    total  2004  292805298.0      NaN
2525          USA  under18  2004   73297735.0      NaN
2526          USA    total  2005  295516599.0      NaN
2527          USA  under18  2005   73523669.0      NaN
2528          USA    total  2006  298379912.0      NaN
2529          USA  under18  2006   73757714.0      NaN
2530          USA    total  2007  301231207.0      NaN
2531          USA  under18  2007   74019405.0      NaN
2532          USA    total  2008  304093966.0      NaN
2533          USA  under18  2008   74104602.0      NaN
2534          USA  under18  2013   73585872.0      NaN
2535          USA    total  2013  316128839.0      NaN
2536          USA    total  2009  306771529.0      NaN
2537          USA  under18  2009   74134167.0      NaN
2538          USA  under18  2010   74119556.0      NaN
2539          USA    total  2010  309326295.0      NaN
2540          USA  under18  2011   73902222.0      NaN
2541          USA    total  2011  311582564.0      NaN
2542          USA  under18  2012   73708179.0      NaN
2543          USA    total  2012  313873685.0      NaN

[2544 rows x 5 columns]

Now let's check whether we have any ``Null`` values or not

In [295]:
state_pop.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [296]:
state_pop[state_pop['population'].isnull()].head()   ---> wherever there is Null value in population column pri

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [297]:
state_pop.isna().sum()

state/region     0
ages             0
year             0
population      20
state           96
dtype: int64

In [298]:
state_pop.loc[2448]

state/region         PR
ages            under18
year               1990
population          NaN
state               NaN
Name: 2448, dtype: object

In [508]:
#state_pop['state'].unique()
state_pop.loc[    state_pop['state'].isnull(), 'state/region']   ---> Get all rows where state column has null value
state_pop.head()

SyntaxError: invalid syntax (<ipython-input-508-d6a575d57612>, line 2)

In [511]:
#state_pop.loc[state_pop['state'].isnull(),'state/region']
state_pop.loc[state_pop['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

Above results indicates that entries for Puerto Rico and United States does not appear in the "state" column. We can fix this by adding appropriate values to "state" column

In [512]:
state_pop['state/region'] == 'PR'
#state_pop.head()

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
2514    False
2515    False
2516    False
2517    False
2518    False
2519    False
2520    False
2521    False
2522    False
2523    False
2524    False
2525    False
2526    False
2527    False
2528    False
2529    False
2530    False
2531    False
2532    False
2533    False
2534    False
2535    False
2536    False
2537    False
2538    False
2539    False
2540    False
2541    False
2542    False
2543    False
Name: state/region, Length: 2544, dtype: bool

Carefully examine below statement. This is how it works
* First argument ``state_pop['state/region'] == 'PR'`` returns boolean series
* Wherever the boolean is ``True``, corresponding ``state`` values is accessed
* New value assigned to the ``state``

In [331]:
state_pop.loc[state_pop['state/region'] == 'PR', 'state']
#state_pop.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [513]:
state_pop.loc[state_pop['state/region'] == 'PR', 'state'] = 'Puerto Rico'
state_pop.loc[state_pop['state/region'] == 'USA', 'state'] = 'United States'
state_pop.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

No more ``NaN`` in state

In [514]:
display(state_pop.head(),areas.head())

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [515]:
final = pd.merge(state_pop, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [313]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [316]:
#final['state'][final['area (sq. mi)'].isnull()].unique()
final.loc[final['area (sq. mi)'].isnull(),'state'].unique()   ---> Give me all unique state value where area is NOne

array(['United States'], dtype=object)

We have two options here
1) Fill these Null values with appropriate value
2) Drop Null values

Filling will not have impact on our result. So we will just drop it

In [518]:
final.loc[final['population'].isnull(),'state'].unique()
final.loc[final['population'].isnull(),'year'].unique()

array([1990, 1991, 1993, 1992, 1994, 1995, 1996, 1998, 1997, 1999])

In [523]:
final.dropna(inplace=True)

In [524]:
final['density'] = final['population'] / final['area (sq. mi)']
final.head()

  state/region     ages  year  population    state  area (sq. mi)    density
0           AL  under18  2012   1117489.0  Alabama        52423.0  21.316769
1           AL    total  2012   4817528.0  Alabama        52423.0  91.897221
2           AL  under18  2010   1130966.0  Alabama        52423.0  21.573851
3           AL    total  2010   4785570.0  Alabama        52423.0  91.287603
4           AL  under18  2011   1125763.0  Alabama        52423.0  21.474601

In [528]:
final.loc[final.year == 2010]
#final.head()

,state/region,ages,year,population,state,area (sq. mi),density
2,AL,under18,2010,1130966.0,Alabama,52423.0,21.573851
3,AL,total,2010,4785570.0,Alabama,52423.0,91.287603
90,AK,under18,2010,187902.0,Alaska,656425.0,0.286251
91,AK,total,2010,713868.0,Alaska,656425.0,1.087509
100,AZ,under18,2010,1628563.0,Arizona,114006.0,14.284889
101,AZ,total,2010,6408790.0,Arizona,114006.0,56.214497
188,AR,under18,2010,711947.0,Arkansas,53182.0,13.386992
189,AR,total,2010,2922280.0,Arkansas,53182.0,54.948667
196,CA,under18,2010,9284094.0,California,163707.0,56.711649
197,CA,total,2010,37333601.0,California,163707.0,228.051342
282,CO,under18,2010,1226619.0,Colorado,104100.0,11.783084
283,CO,total,2010,5048196.0,Colorado,104100.0,48.493718
292,CT,under18,2010,814187.0,Connecticut,5544.0,146.859127
293,CT,total,2010,3579210.0,Connecticut,5544.0,645.600649
378,DE,under18,2010,205478.0,Delaware,1954.0,105.157625
379,DE,total,2010,899711.0,Delaware,1954.0,460.445752
388,DC,under18,2010,101309.0,District of Columbia,68.0,1489.838235
389,DC,total,2010,605125.0,District of Columbia,68.0,8898.897059
474,FL,under18,2010,3999532.0,Florida,65758.0,60.821984
475,FL,total,2010,18846054.0,Florida,65758.0,286.597129
484,GA,under18,2010,2490884.0,Georgia,59441.0,41.905150
485,GA,total,2010,9713248.0,Georgia,59441.0,163.409902
570,HI,total,2010,1363731.0,Hawaii,10932.0,124.746707
571,HI,under18,2010,303812.0,Hawaii,10932.0,27.791072
580,ID,under18,2010,428961.0,Idaho,83574.0,5.132709
581,ID,total,2010,1570718.0,Idaho,83574.0,18.794338
666,IL,total,2010,12839695.0,Illinois,57918.0,221.687472
667,IL,under18,2010,3122092.0,Illinois,57918.0,53.905383
676,IN,under18,2010,1605883.0,Indiana,36420.0,44.093438
677,IN,total,2010,6489965.0,Indiana,36420.0,178.197831
...,...,...,...,...,...,...,...
1818,OR,total,2010,3837208.0,Oregon,98386.0,39.001565
1819,OR,under18,2010,865129.0,Oregon,98386.0,8.793212
1828,PA,under18,2010,2785316.0,Pennsylvania,46058.0,60.474098
1829,PA,total,2010,12710472.0,Pennsylvania,46058.0,275.966651
1914,RI,total,2010,1052669.0,Rhode Island,1545.0,681.339159
1915,RI,under18,2010,223088.0,Rhode Island,1545.0,144.393528
1924,SC,under18,2010,1079978.0,South Carolina,32007.0,33.741931
1925,SC,total,2010,4636361.0,South Carolina,32007.0,144.854594
2010,SD,total,2010,816211.0,South Dakota,77121.0,10.583512
2011,SD,under18,2010,203145.0,South Dakota,77121.0,2.634107
2020,TN,under18,2010,1495090.0,Tennessee,42146.0,35.474066
2021,TN,total,2010,6356683.0,Tennessee,42146.0,150.825298
2106,TX,total,2010,25245178.0,Texas,268601.0,93.987655
2107,TX,under18,2010,6879014.0,Texas,268601.0,25.610530
2116,UT,under18,2010,873019.0,Utah,84904.0,10.282425
2117,UT,total,2010,2774424.0,Utah,84904.0,32.677188
2202,VT,total,2010,625793.0,Vermont,9615.0,65.085075
2203,VT,under18,2010,128601.0,Vermont,9615.0,13.375039
2212,VA,under18,2010,1855025.0,Virginia,42769.0,43.373121
2213,VA,total,2010,8024417.0,Virginia,42769.0,187.622273
2298,WA,total,2010,6742256.0,Washington,71303.0,94.557817
2299,WA,under18,2010,1581436.0,Washington,71303.0,22.179095
2308,WV,under18,2010,387224.0,West Virginia,24231.0,15.980521
2309,WV,total,2010,1854146.0,West Virginia,24231.0,76.519582
2394,WI,total,2010,5689060.0,Wisconsin,65503.0,86.851900
2395,WI,under18,2010,1336094.0,Wisconsin,65503.0,20.397447
2404,WY,under18,2010,135351.0,Wyoming,97818.0,1.383702
2405,WY,total,2010,564222.0,Wyoming,97818.0,5.768079
2490,PR,total,2010,3721208.0,Puerto Rico,3515.0,1058.665149
2491,PR,under18,2010,896945.0,Puerto Rico,3515.0,255.176387

### Simple Aggregation in Pandas

Aggregation in ``Series``

In [337]:
ser = pd.Series(np.random.random(5))
ser

0    0.661673
1    0.736173
2    0.577408
3    0.759248
4    0.888180
dtype: float64

In [338]:
ser.sum()

3.622682239084041

In [339]:
ser.mean()

0.7245364478168083

Aggregation on ``DataFrame``

In [529]:
df = pd.DataFrame({'A':np.random.random(5),'B':np.random.random(5)})
df

          A         B
0  0.253738  0.238485
1  0.413402  0.539523
2  0.452238  0.549762
3  0.819080  0.376042
4  0.844640  0.981859

In [347]:
df.sum()

A    3.394242
B    2.766741
dtype: float64

In [348]:
df.sum(axis=1)

0    0.973759
1    1.656619
2    1.226525
3    1.063868
4    1.240213
dtype: float64

Pandas provide ``describe()`` method which calculates some common aggregator for ``DataFrame``

In [350]:
df.describe()

              A         B
count  5.000000  5.000000
mean   0.678848  0.553348
std    0.344849  0.263673
min    0.211522  0.265827
25%    0.427537  0.272984
50%    0.798040  0.666706
75%    0.967229  0.762236
max    0.989914  0.798987

### GroupBy: Split, Apply, Combine

``groupBy`` does following 
* The split step breaks up and groups a DataFrame depending on the value of the specified key.
* The apply step  computs some function, usually an aggregate, transformation, or filtering, within the individual groups.
* The combine step merges the results of these operations into an output array.

In [530]:
#df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
#                   'data': range(6)}, columns=['key', 'data'])
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': [1,2,3,4,5,6]})
df

  key  data
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [363]:
df.groupby('key')

``groupBy`` returns ``DataFrameGroupBy`` object. We can perform bunch of aggregatino function on this object

In [531]:
df.groupby('key').sum()

     data
key
A       5
B       7
C       9

In [536]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': np.random.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      3
1   B      1      2
2   C      2      6
3   A      3      2
4   B      4      9
5   C      5      8

``aggregate()``can take a string, a function, or a list thereof, and compute all the aggregates at once. Here is a quick example combining all these:

In [537]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     2    2.5   3
B       1    2.5   4     2    5.5   9
C       2    3.5   5     6    7.0   8

#### Filter

In [538]:
def filter_func(x):
    return x['data2'].sum() > 10

#display(df, df.groupby('key').sum(), df.groupby('key').filter(filter_func))

display(df, df.groupby('key').sum(), df.groupby('key').filter(lambda x:x['data2'].sum() > 10))

  key  data1  data2
0   A      0      3
1   B      1      2
2   C      2      6
3   A      3      2
4   B      4      9
5   C      5      8

     data1  data2
key
A        3      5
B        5     11
C        7     14

  key  data1  data2
1   B      1      2
2   C      2      6
4   B      4      9
5   C      5      8

#### Transformation

``filter()`` method returns the reduced version of data while ``transform()`` function return transformation of full data

In [539]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    0.5
1   -1.5   -3.5
2   -1.5   -1.0
3    1.5   -0.5
4    1.5    3.5
5    1.5    1.0

#### apply()

``apply()`` method takes ``DataFrame`` as input outputs scalar or other Pandas object as output

In [378]:
def add_five(x):
    # x is a DataFrame of group values
    x['data1'] += 5
    return x

display(df, df.groupby('key').apply(add_five))

  key  data1  data2
0   A      0      7
1   B      1      8
2   C      2      1
3   A      3      4
4   B      4      6
5   C      5      5

  key  data1  data2
0   A      5      7
1   B      6      8
2   C      7      1
3   A      8      4
4   B      9      6
5   C     10      5